LOADING LIBRARY

In [3]:
import pandas  as pd
import numpy as np

CREATE A DATA FRAME

In [4]:
## creating the data 
data ={
    "roll_no":[2,3,4,5],
    "papper_id":[100,101,102,103],
    "marks":[454,44,50,15]
      }

In [6]:
df1=pd.DataFrame(data)  ## passing the data into the data frame function

In [7]:
df1   ## printing the data frame

   roll_no  papper_id  marks
0        2        100    454
1        3        101     44
2        4        102     50
3        5        103     15

here in the baove data fraem the inex valies has come as 0,1,2,3,4....
but to ge a name at the index position we can do the following below

SETTING INDEX

In [27]:
## we are realocating th index position with the names we want
df2=pd.DataFrame(data,index=["tushar","dishari","rohan","kediaa"])

In [28]:
df2

         roll_no  papper_id  marks
tushar         2        100    454
dishari        3        101     44
rohan          4        102     50
kediaa         5        103     15

EXTRACTINHG INFOMATION

Loc is used for the labels and the iloc is used for the indexes

In [29]:
## using loc and iloc

df2.loc["tushar"]

roll_no        2
papper_id    100
marks        454
Name: tushar, dtype: int64

In [39]:
df2.loc["tushar":"rohan"]  ##colon can only be used outside the [] brackets

         roll_no  papper_id  marks
tushar         2        100    454
dishari        3        101     44
rohan          4        102     50

In [40]:
df2.loc[["tushar","rohan"]]  ## comma can only be used inside [] brackets

        roll_no  papper_id  marks
tushar        2        100    454
rohan         4        102     50

In [61]:
df2.loc[["tushar","rohan"],["roll_no","marks"]]

        roll_no  marks
tushar        2    454
rohan         4     50

In [63]:
df2.loc["tushar":"rohan",["roll_no","marks"]]

         roll_no  marks
tushar         2    454
dishari        3     44
rohan          4     50

In [54]:
df2.loc[:,"roll_no":"paper_id"]

         roll_no  papper_id
tushar         2        100
dishari        3        101
rohan          4        102
kediaa         5        103

In [47]:
df2.loc["tushar":"rohan","roll_no":"marks"]

         roll_no  papper_id  marks
tushar         2        100    454
dishari        3        101     44
rohan          4        102     50

In [65]:
## in indexes the last value is always  excluded . here 2 is excluded
df2.iloc[0:2]

         roll_no  papper_id  marks
tushar         2        100    454
dishari        3        101     44

In [67]:
df2.iloc[0:2,0:2]

         roll_no  papper_id
tushar         2        100
dishari        3        101

In [69]:
## comma prints only the values mentioned
df2.iloc[[0,2],[0,2]]

        roll_no  marks
tushar        2    454
rohan         4     50